# короч ти пишеш касовий апарат.
# приходить клієнт з певною кількістю готівки і набором товарів.
# в магазині працює скидка - перші три товари оплачуєш повністю, а решту зі скидкою в 30%
# визнач, чи вистачить покупцю грошей.
# якщо так - напиши скільки коштуватиме вся покупка. якщо ні - напиши скільки не вистачає клієнту

# пограйся з цими змінними, щоб перевірити рішення
initial_cash = 1000                     # це скільки грошей у покупця
prices = [10, 22, 14.5, 80, 4, 9, 33]   # це вартість кожного товару

# solution goes here
